[
  {"id": 1, "fact": "Otters are mammals in the weasel family, Mustelidae, which also includes badgers, wolverines, and ferrets.", "category": "biology"},
  {"id": 2, "fact": "There are 13 living species of otter found across the world.", "category": "species"},
  {"id": 3, "fact": "Otters live on every continent except Australia and Antarctica.", "category": "habitat"},
  {"id": 4, "fact": "Most otter species live in freshwater rivers and lakes, but the sea otter is fully marine.", "category": "habitat"},
  {"id": 5, "fact": "Sea otters are the heaviest members of the weasel family, weighing up to 100 pounds.", "category": "biology"},
  {"id": 6, "fact": "The giant otter of South America is the longest otter species, reaching up to 6 feet from nose to tail.", "category": "species"},
  {"id": 7, "fact": "The Asian small-clawed otter is the smallest otter species, weighing only about 6-12 pounds.", "category": "species"},
  {"id": 8, "fact": "Otters have long, streamlined bodies that reduce drag in water, making them excellent swimmers.", "category": "biology"},
  {"id": 9, "fact": "Otters have short legs and webbed feet that work like flippers for efficient swimming.", "category": "biology"},
  {"id": 10, "fact": "An otter's tail is muscular and helps with propulsion and steering underwater.", "category": "biology"},
  {"id": 11, "fact": "Otters have five toes on each foot, and most species have sharp claws for catching slippery fish.", "category": "biology"},
  {"id": 12, "fact": "Asian small-clawed otters have reduced claws, giving them better dexterity to feel for prey under rocks.", "category": "species"},
  {"id": 13, "fact": "Otters use their sensitive whiskers, called vibrissae, to detect prey movement in murky water.", "category": "behavior"},
  {"id": 14, "fact": "Otter ears and nostrils can close tightly underwater to keep water out during dives.", "category": "biology"},
  {"id": 15, "fact": "Otters can see well both underwater and on land thanks to special adaptations in their eyes.", "category": "biology"},
  {"id": 16, "fact": "Otters are carnivores that primarily eat fish, but also enjoy crustaceans, frogs, and other aquatic animals.", "category": "behavior"},
  {"id": 17, "fact": "River otters love to eat fish, amphibians, crayfish, and sometimes small mammals or birds.", "category": "behavior"},
  {"id": 18, "fact": "Sea otters specialize in eating shellfish like clams, mussels, crabs, and sea urchins.", "category": "behavior"},
  {"id": 19, "fact": "By eating sea urchins, sea otters help protect kelp forests from being overgrazed.", "category": "conservation"},
  {"id": 20, "fact": "Sea otters are a keystone species, meaning their presence is essential for the health of kelp forest ecosystems.", "category": "conservation"},
  {"id": 21, "fact": "Otters have a very high metabolism and need to eat frequently to maintain their body temperature.", "category": "biology"},
  {"id": 22, "fact": "Sea otters eat roughly 20 to 30 percent of their body weight every single day.", "category": "behavior"},
  {"id": 23, "fact": "Otters groom their fur constantly to keep it clean and full of insulating air bubbles.", "category": "behavior"},
  {"id": 24, "fact": "Otter fur has two layers: a dense underlayer and longer guard hairs on top.", "category": "biology"},
  {"id": 25, "fact": "Sea otters have the densest fur of any mammal on Earth.", "category": "biology"},
  {"id": 26, "fact": "Sea otter fur can have up to one million hairs per square inch!", "category": "biology"},
  {"id": 27, "fact": "Unlike seals and whales, sea otters have no blubber and rely entirely on their fur for warmth.", "category": "biology"},
  {"id": 28, "fact": "Otters trap tiny air bubbles in their fur, which helps insulate them in cold water.", "category": "biology"},
  {"id": 29, "fact": "Otters can spend several hours each day grooming to maintain their waterproof coat.", "category": "behavior"},
  {"id": 30, "fact": "Sea otters float on their backs to eat, groom, and even sleep.", "category": "behavior"},
  {"id": 31, "fact": "Sea otters have loose skin pouches under their forearms where they store food and favorite tools.", "category": "biology"},
  {"id": 32, "fact": "Sea otters are one of the very few mammals known to use tools.", "category": "behavior"},
  {"id": 33, "fact": "Sea otters use rocks to crack open hard-shelled prey like clams and mussels.", "category": "behavior"},
  {"id": 34, "fact": "A sea otter often keeps a favorite rock and uses it over and over again.", "category": "behavior"},
  {"id": 35, "fact": "Sea otters place rocks on their chests while floating and use them as anvils to smash shellfish.", "category": "behavior"},
  {"id": 36, "fact": "Groups of sea otters floating together are called rafts.", "category": "behavior"},
  {"id": 37, "fact": "Rafting sea otters sometimes hold hands (paws) while sleeping to keep from drifting apart.", "category": "behavior"},
  {"id": 38, "fact": "Sea otters wrap themselves in kelp strands to stay anchored while they rest.", "category": "behavior"},
  {"id": 39, "fact": "Otters can hold their breath for several minutes when diving for food.", "category": "biology"},
  {"id": 40, "fact": "River otters can stay underwater for around six to eight minutes on a single breath.", "category": "biology"},
  {"id": 41, "fact": "Sea otter dives are usually shorter, typically lasting one to four minutes.", "category": "behavior"},
  {"id": 42, "fact": "Otters use their nimble forepaws to handle food with impressive dexterity, almost like hands.", "category": "behavior"},
  {"id": 43, "fact": "Otters are famous for being playful and often slide down muddy or snowy slopes just for fun.", "category": "behavior"},
  {"id": 44, "fact": "Sliding behavior helps otters travel efficiently between water and land.", "category": "behavior"},
  {"id": 45, "fact": "Otters are incredibly agile swimmers and can twist, roll, and turn quickly underwater.", "category": "behavior"},
  {"id": 46, "fact": "While otters are clumsy on land compared to water, they can still run at decent speeds when needed.", "category": "behavior"},
  {"id": 47, "fact": "Otters communicate with each other using chirps, whistles, growls, and screams.", "category": "behavior"},
  {"id": 48, "fact": "Otters have scent glands that produce a strong-smelling musk used to mark territory.", "category": "behavior"},
  {"id": 49, "fact": "Otter droppings are called spraint and have a distinctive fishy smell.", "category": "biology"},
  {"id": 50, "fact": "Otters use spraint to communicate territory boundaries and reproductive status to other otters.", "category": "behavior"},
  {"id": 51, "fact": "Otter dens are called holts and are often located in riverbanks or among tree roots.", "category": "habitat"},
  {"id": 52, "fact": "Otters may use burrows, hollow logs, rock crevices, or dense vegetation as their homes.", "category": "habitat"},
  {"id": 53, "fact": "Many otter species are crepuscular, meaning they are most active at dawn and dusk.", "category": "behavior"},
  {"id": 54, "fact": "Some otter species like giant otters are highly social, while others prefer to live alone.", "category": "behavior"},
  {"id": 55, "fact": "Male and female sea otters often form separate rafts except during breeding season.", "category": "behavior"},
  {"id": 56, "fact": "Female sea otters raise their pups alone without help from the father.", "category": "behavior"},
  {"id": 57, "fact": "Otter pups are born with their eyes closed and are completely dependent on their mothers.", "category": "biology"},
  {"id": 58, "fact": "Sea otter pups are born with fluffy, buoyant fur that helps them float like corks.", "category": "biology"},
  {"id": 59, "fact": "Mother sea otters carry their pups on their bellies while floating on their backs.", "category": "behavior"},
  {"id": 60, "fact": "Mother otters patiently teach their pups how to swim, dive, and hunt for food.", "category": "behavior"},
  {"id": 61, "fact": "Some otter species experience delayed implantation, where embryo development pauses before pregnancy continues.", "category": "biology"},
  {"id": 62, "fact": "Otters have excellent hearing that helps them detect both prey underwater and predators on land.", "category": "biology"},
  {"id": 63, "fact": "Otter whiskers are so sensitive they can detect the movement of prey in complete darkness.", "category": "biology"},
  {"id": 64, "fact": "Healthy otter populations indicate clean water and thriving aquatic ecosystems.", "category": "conservation"},
  {"id": 65, "fact": "Otters need clean water with abundant fish and invertebrates to survive and thrive.", "category": "conservation"},
  {"id": 66, "fact": "Pollution, especially from oil spills, can devastate otter populations by ruining their insulating fur.", "category": "conservation"},
  {"id": 67, "fact": "Habitat loss from development along rivers and coastlines threatens many otter species.", "category": "conservation"},
  {"id": 68, "fact": "Otters were heavily hunted for their valuable fur in past centuries, nearly driving some species to extinction.", "category": "conservation"},
  {"id": 69, "fact": "Sea otter populations crashed during the fur trade era, dropping from hundreds of thousands to only about 2,000.", "category": "conservation"},
  {"id": 70, "fact": "Conservation laws and protected areas have helped many otter populations recover significantly.", "category": "conservation"},
  {"id": 71, "fact": "Sea otters are now protected under the Marine Mammal Protection Act in the United States.", "category": "conservation"},
  {"id": 72, "fact": "River otters can travel over land for miles to find new water bodies.", "category": "behavior"},
  {"id": 73, "fact": "Otters have extremely flexible spines that allow them to twist and turn with amazing agility.", "category": "biology"},
  {"id": 74, "fact": "When chasing fish, otters roll, spiral, and make sharp turns to catch their prey.", "category": "behavior"},
  {"id": 75, "fact": "Sea otters use their large, flipper-like hind feet as rudders for steering.", "category": "biology"},
  {"id": 76, "fact": "River otters use their powerful, tapered tails like paddles to propel through water.", "category": "biology"},
  {"id": 77, "fact": "After swimming, otters shake and roll vigorously to squeeze water out of their fur.", "category": "behavior"},
  {"id": 78, "fact": "Otters have a strong bite force that helps them crack shells and grip slippery fish.", "category": "biology"},
  {"id": 79, "fact": "Giant otters live in close family groups and hunt cooperatively, calling to each other constantly.", "category": "species"},
  {"id": 80, "fact": "Giant otters are native to the rivers and wetlands of South America, especially the Amazon basin.", "category": "species"},
  {"id": 81, "fact": "The North American river otter is found across much of Canada and the United States.", "category": "species"},
  {"id": 82, "fact": "The European otter, also called the Eurasian otter, is widespread across Europe and parts of Asia.", "category": "species"},
  {"id": 83, "fact": "The smooth-coated otter gets its name from its sleek, velvety fur that lies flat.", "category": "species"},
  {"id": 84, "fact": "The African clawless otter has no claws on its front feet, giving it finger-like dexterity.", "category": "species"},
  {"id": 85, "fact": "The spotted-necked otter has distinctive pale spots on its throat and chest.", "category": "species"},
  {"id": 86, "fact": "The neotropical otter lives in rivers and coastal areas of Central and South America.", "category": "species"},
  {"id": 87, "fact": "The marine otter, one of the rarest otter species, lives along the rocky Pacific coast of South America.", "category": "species"},
  {"id": 88, "fact": "Sea otters live along the coasts of the North Pacific, from Alaska to California and across to Russia and Japan.", "category": "species"},
  {"id": 89, "fact": "The Congo clawless otter is one of the least-studied and most mysterious otter species.", "category": "species"},
  {"id": 90, "fact": "Just like humans, otters can be right-handed or left-handed when using tools!", "category": "behavior"},
  {"id": 91, "fact": "Otters often groom each other, which strengthens social bonds and family relationships.", "category": "behavior"},
  {"id": 92, "fact": "If an otter's fur gets dirty or oily, it loses its ability to insulate, which can be life-threatening.", "category": "biology"},
  {"id": 93, "fact": "Sea otters can sleep floating on the water, often with their paws covering their eyes.", "category": "behavior"},
  {"id": 94, "fact": "Otters are naturally curious and love to investigate new objects in their environment.", "category": "behavior"},
  {"id": 95, "fact": "Otter pups play constantly, which helps them develop hunting skills and social abilities.", "category": "behavior"},
  {"id": 96, "fact": "Otters have strong forelimbs that help them dig burrows and manipulate prey.", "category": "biology"},
  {"id": 97, "fact": "Some otters can dive to depths of over 60 feet when hunting for food.", "category": "behavior"},
  {"id": 98, "fact": "Sea otters spend nearly their entire lives in the ocean, rarely coming onto land.", "category": "habitat"},
  {"id": 99, "fact": "Most other otter species split their time between water and land throughout the day.", "category": "habitat"},
  {"id": 100, "fact": "By controlling populations of prey animals, otters help maintain balance in aquatic food webs.", "category": "conservation"},
  {"id": 101, "fact": "Otters often return to the same favorite resting spots day after day.", "category": "behavior"},
  {"id": 102, "fact": "Giant otter families can be very vocal, with up to 22 different types of calls identified.", "category": "species"},
  {"id": 103, "fact": "Otter fossils show that the otter family has existed for at least 30 million years.", "category": "biology"},
  {"id": 104, "fact": "The hairy-nosed otter of Southeast Asia is critically endangered with very few left in the wild.", "category": "conservation"},
  {"id": 105, "fact": "Sea otter mothers rarely leave their pups, even wrapping them in kelp to keep them safe while diving.", "category": "behavior"},
  {"id": 106, "fact": "Baby sea otters cannot dive at first because their fluffy fur makes them too buoyant to sink.", "category": "biology"},
  {"id": 107, "fact": "Otters have special muscles that let them close their ears and nostrils completely underwater.", "category": "biology"},
  {"id": 108, "fact": "River otters can run as fast as 18 miles per hour on land for short distances.", "category": "behavior"},
  {"id": 109, "fact": "Sea otters groom for about 2-3 hours every single day to keep their fur in perfect condition.", "category": "behavior"},
  {"id": 110, "fact": "Otters have a third eyelid called a nictitating membrane that protects their eyes underwater.", "category": "biology"}
]
